class_name: Model
config:
  input_layers:
  - [train_input_img, 0, 0]
  - [train_input_idx, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 48, 116, 3]
      input_dtype: float32
      name: train_input_img
      sparse: false
    inbound_nodes: []
    name: train_input_img
  - class_name: Model
    config:
      input_layers:
      - [input_9, 0, 0]
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple [null, 48, 116, 3]
          input_dtype: float32
          name: input_9
          sparse: false
        inbound_nodes: []
        name: input_9
      - class_name: Convolution2D
        config:
          W_constraint: null
          W_regularizer: null
          activation: tanh
          activity_regularizer: null
          b_constraint: null
          b_regularizer: null
          bias: true
          border_mode: valid
          dim_ordering: tf
          init: glorot_uniform
          name: convolution2d_11
          nb_col: 3
          nb_filter: 32
          nb_row: 3
          subsample: &id001 !!python/tuple [1, 1]
          trainable: true
        inbound_nodes:
        - - [input_9, 0, 0]
        name: convolution2d_11
      - class_name: Convolution2D
        config:
          W_constraint: null
          W_regularizer: null
          activation: relu
          activity_regularizer: null
          b_constraint: null
          b_regularizer: null
          bias: true
          border_mode: valid
          dim_ordering: tf
          init: glorot_uniform
          name: convolution2d_12
          nb_col: 3
          nb_filter: 32
          nb_row: 3
          subsample: *id001
          trainable: true
        inbound_nodes:
        - - [convolution2d_11, 0, 0]
        name: convolution2d_12
      - class_name: Dropout
        config: {name: dropout_15, p: 0.2, trainable: true}
        inbound_nodes:
        - - [convolution2d_12, 0, 0]
        name: dropout_15
      - class_name: MaxPooling2D
        config:
          border_mode: valid
          dim_ordering: tf
          name: maxpooling2d_7
          pool_size: &id002 !!python/tuple [2, 2]
          strides: *id002
          trainable: true
        inbound_nodes:
        - - [dropout_15, 0, 0]
        name: maxpooling2d_7
      - class_name: Convolution2D
        config:
          W_constraint: null
          W_regularizer: null
          activation: relu
          activity_regularizer: null
          b_constraint: null
          b_regularizer: null
          bias: true
          border_mode: valid
          dim_ordering: tf
          init: glorot_uniform
          name: convolution2d_13
          nb_col: 3
          nb_filter: 64
          nb_row: 3
          subsample: *id001
          trainable: true
        inbound_nodes:
        - - [maxpooling2d_7, 0, 0]
        name: convolution2d_13
      - class_name: Dropout
        config: {name: dropout_16, p: 0.2, trainable: true}
        inbound_nodes:
        - - [convolution2d_13, 0, 0]
        name: dropout_16
      - class_name: MaxPooling2D
        config:
          border_mode: valid
          dim_ordering: tf
          name: maxpooling2d_8
          pool_size: &id003 !!python/tuple [2, 2]
          strides: *id003
          trainable: true
        inbound_nodes:
        - - [dropout_16, 0, 0]
        name: maxpooling2d_8
      - class_name: Convolution2D
        config:
          W_constraint: null
          W_regularizer: null
          activation: relu
          activity_regularizer: null
          b_constraint: null
          b_regularizer: null
          bias: true
          border_mode: valid
          dim_ordering: tf
          init: glorot_uniform
          name: convolution2d_14
          nb_col: 3
          nb_filter: 128
          nb_row: 3
          subsample: *id001
          trainable: true
        inbound_nodes:
        - - [maxpooling2d_8, 0, 0]
        name: convolution2d_14
      - class_name: Dropout
        config: {name: dropout_17, p: 0.2, trainable: true}
        inbound_nodes:
        - - [convolution2d_14, 0, 0]
        name: dropout_17
      - class_name: MaxPooling2D
        config:
          border_mode: valid
          dim_ordering: tf
          name: maxpooling2d_9
          pool_size: &id004 !!python/tuple [2, 2]
          strides: *id004
          trainable: true
        inbound_nodes:
        - - [dropout_17, 0, 0]
        name: maxpooling2d_9
      - class_name: Flatten
        config: {name: flatten_3, trainable: true}
        inbound_nodes:
        - - [maxpooling2d_9, 0, 0]
        name: flatten_3
      - class_name: Dense
        config:
          W_constraint: null
          W_regularizer: null
          activation: relu
          activity_regularizer: null
          b_constraint: null
          b_regularizer: null
          bias: true
          init: glorot_uniform
          input_dim: !!python/object/apply:numpy.core.multiarray.scalar
          - !!python/object/apply:numpy.dtype
            args: [i8, 0, 1]
            state: !!python/tuple [3, <, null, null, null, -1, -1, 0]
          - "\0\x18\0\0\0\0\0\0"
          name: dense_13
          output_dim: 512
          trainable: true
        inbound_nodes:
        - - [flatten_3, 0, 0]
        name: dense_13
      name: vision
      output_layers:
      - [dense_13, 0, 0]
    inbound_nodes:
    - - [train_input_img, 0, 0]
    name: vision
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7]
      input_dtype: float32
      name: train_input_idx
      sparse: false
    inbound_nodes: []
    name: train_input_idx
  - class_name: Model
    config:
      input_layers:
      - [input_10, 0, 0]
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple [null, 512]
          input_dtype: float32
          name: input_10
          sparse: false
        inbound_nodes: []
        name: input_10
      - class_name: Dense
        config: {W_constraint: null, W_regularizer: null, activation: relu, activity_regularizer: null,
          b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform,
          input_dim: 512, name: dense_14, output_dim: 256, trainable: true}
        inbound_nodes:
        - - [input_10, 0, 0]
        name: dense_14
      - class_name: Dropout
        config: {name: dropout_18, p: 0.2, trainable: true}
        inbound_nodes:
        - - [dense_14, 0, 0]
        name: dropout_18
      - class_name: Dense
        config: {W_constraint: null, W_regularizer: null, activation: softmax, activity_regularizer: null,
          b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform,
          input_dim: 256, name: dense_15, output_dim: 7, trainable: true}
        inbound_nodes:
        - - [dropout_18, 0, 0]
        name: dense_15
      name: counter
      output_layers:
      - [dense_15, 0, 0]
    inbound_nodes:
    - - [vision, 1, 0]
    name: counter
  - class_name: Model
    config:
      input_layers:
      - [input_11, 0, 0]
      - [input_12, 0, 0]
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple [null, 512]
          input_dtype: float32
          name: input_11
          sparse: false
        inbound_nodes: []
        name: input_11
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple [null, 7]
          input_dtype: float32
          name: input_12
          sparse: false
        inbound_nodes: []
        name: input_12
      - class_name: Merge
        config:
          arguments: {}
          concat_axis: -1
          dot_axes: -1
          mode: concat
          mode_type: raw
          name: merge_3
          output_mask: null
          output_mask_type: raw
          output_shape: null
          output_shape_type: raw
        inbound_nodes:
        - - [input_11, 0, 0]
          - [input_12, 0, 0]
        name: merge_3
      - class_name: Dense
        config: {W_constraint: null, W_regularizer: null, activation: relu, activity_regularizer: null,
          b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform,
          input_dim: 519, name: dense_16, output_dim: 512, trainable: true}
        inbound_nodes:
        - - [merge_3, 0, 0]
        name: dense_16
      - class_name: Dropout
        config: {name: dropout_19, p: 0.2, trainable: true}
        inbound_nodes:
        - - [dense_16, 0, 0]
        name: dropout_19
      - class_name: Dense
        config: {W_constraint: null, W_regularizer: null, activation: softmax, activity_regularizer: null,
          b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform,
          input_dim: 512, name: dense_17, output_dim: 10, trainable: true}
        inbound_nodes:
        - - [dropout_19, 0, 0]
        name: dense_17
      name: detector
      output_layers:
      - [dense_17, 0, 0]
    inbound_nodes:
    - - [vision, 1, 0]
      - [train_input_idx, 0, 0]
    name: detector
  name: model_3
  output_layers:
  - [counter, 1, 0]
  - [detector, 1, 0]
keras_version: 1.2.0
